# Direct Context 3DHandle Settings Methods

Source: https://www.revitapidocs.com/2026/23a2b0a2-d89e-6238-cafb-10d9e5f8c157.htm

---

| Direct Context 3DHandle Settings Methods |
| --- |

The DirectContext3DHandleSettings type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetColor | Gets the color of the handle and the associated DirectContext3D graphics. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetTransparency | Gets the transparency value of the handle and the associated DirectContext3D graphics. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsEqual | Check if the contents of two instances of settings are equal. |
|  | SetColor | Sets the color of the handle and the associated DirectContext3D graphics. |
|  | SetTransparency | Sets the transparency value of the handle and the associated DirectContext3D graphics. |
|  | SetVisibility | Visibility of the handle and the associated DirectContext3D graphics.  A value of true means that the graphics are visible. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

DirectContext3DHandleSettings Class Autodesk.Revit.DB.DirectContext3D Namespace